open-vela/contest2026_264_VelaSightsuixingAIzhinengyanjing/board/beken/boards/bk7258/bk7258-ap/src/bk7258_camera_imgsensor.c
/****************************************************************************
 * board/beken/boards/bk7258/bk7258-ap/src/bk7258_camera_imgsensor.c
 *
 * GC2145 sensor-side (imgsensor) driver: NuttX V4L2 imgsensor_ops_s
 * implementation.  This is the sensor device layer half of the driver
 * split described in the openvela Camera Driver Framework guide -- it
 * owns I2C register programming, power/reset sequencing, and DVP
 * pinmux/MCLK setup; the platform (YUV_BUF/DMA/full-frame-assembly)
 * half lives in board/beken/chips/bk7258/bk7258_camera_imgdata.c.
 *
 * Register tables (g_gc2145_init_regs, g_gc2145_640_480_regs) and the
 * power/reset/pinmux/MCLK sequence below are ported from bk_avdk_smp
 * release/v3.1.1 ap/components/bk_peripheral/src/dvp/dvp_gc2145.c and
 * ap/components/bk_dvp/src/dvp_common.c, cross-checked against
 * AIDK_AI玩具开发板_原理图.pdf for this board's actual pin assignment
 * (GC2145's I2C bus is bit-banged on GPIO42/43, not the SoC's hardware
 * I2C1 peripheral -- see bk7258_gc2145_i2c_bitbang.h).
 *
 * MCLK note: GPIO27 requires pinmux function index 1
 * (GPIO_DEV_CLK_AUXS_CIS), not the index-0 function the other DVP pins
 * use, plus the system controller's AUXS_CIS clock-source-select +
 * divider + gate-enable sequence -- pinmux selection alone does not
 * drive a clock signal onto the pin.  GC2145's power-up sequence
 * requires MCLK to be applied before its I2C/SCCB interface responds.
 *
 * SPDX-License-Identifier: Apache-2.0
 ****************************************************************************/

#include <nuttx/config.h>
#include <nuttx/arch.h>

#include <stddef.h>
#include <stdbool.h>
#include <stdint.h>
#include <stdio.h>
#include <errno.h>

#include <nuttx/video/imgsensor.h>
#include <sys/videoio.h>

#include "arm_internal.h"
#include "bk7258_gpio.h"
#include "bk7258_gc2145_i2c_bitbang.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

#define GC2145_I2C_ADDR       0x3Cu

#define DVP_MCLK_PIN          27u
#define DVP_MCLK_PINMUX_FUNCTION 1u  /* GPIO_DEV_CLK_AUXS_CIS */

#define DVP_PCLK_PIN          29u
#define DVP_HSYNC_PIN         30u
#define DVP_VSYNC_PIN         31u
#define DVP_DATA_PIN(i)       (32u + (i))
#define DVP_PINMUX_FUNCTION   0u    /* GPIO_DEV_JPEG_{PCLK,HSYNC,VSYNC,PXDATAn} */

#define DVP_RESET_PIN         28u
#define DVP_POWER_PIN         49u

/* System clock controller (SOC_SYS_REG_BASE) fields for the AUXS_CIS
 * clock path that drives GC2145's MCLK input pin (GPIO27).
 */

#define BK7258_SYS_REG_BASE             0x44010000u

#define BK7258_SYS_REG_0X0A             (BK7258_SYS_REG_BASE + (0xau << 2))
#define BK7258_SYS_CKSEL_AUXS_CIS_SHIFT 15u
#define BK7258_SYS_CKSEL_AUXS_CIS_MASK  (0x3u << BK7258_SYS_CKSEL_AUXS_CIS_SHIFT)
#define BK7258_SYS_CKDIV_AUXS_CIS_SHIFT 17u
#define BK7258_SYS_CKDIV_AUXS_CIS_MASK  (0x1fu << BK7258_SYS_CKDIV_AUXS_CIS_SHIFT)

#define BK7258_SYS_REG_0X0D             (BK7258_SYS_REG_BASE + (0xdu << 2))
#define BK7258_SYS_CIS_AUXS_CKEN        (1u << 9)

/* MCLK_24M case: cksel=3, ckdiv=19. */

#define GC2145_MCLK_CKSEL               3u
#define GC2145_MCLK_CKDIV               19u

#define GC2145_CAPTURE_WIDTH   640u
#define GC2145_CAPTURE_HEIGHT  480u

/* GC2145 identity registers, per dvp_gc2145.c's CHIP_ID_ADDR_HB/LB and
 * CHIP_ID_VAL_HB/LB.  Readable only after power-on + MCLK, which is why
 * the check lives in init() rather than in is_available().
 */

#define GC2145_CHIP_ID_REG_HI  0xF0u
#define GC2145_CHIP_ID_REG_LO  0xF1u
#define GC2145_CHIP_ID_VAL_HI  0x21u
#define GC2145_CHIP_ID_VAL_LO  0x45u

/* Frame rates this driver can program at 640x480.  The reference's four
 * tables (sensor_gc2145_640_480_{30,25,20,15}fps_table in dvp_gc2145.c)
 * are byte-identical except for registers 0x07/0x08 -- the frame-length
 * (dummy line) high/low pair -- so they are represented here as one
 * shared table plus the per-rate 0x07/0x08 values, rather than four
 * near-duplicate copies.
 */

#define GC2145_FPS_DEFAULT     30u

/****************************************************************************
 * Private Types
 ****************************************************************************/

struct gc2145_reg
{
  uint8_t reg;
  uint8_t value;
};

struct bk7258_gc2145_dev_s
{
  struct imgsensor_s sensor;    /* Must be first: base-pointer cast. */
  bool initialized;
  uint32_t current_fps;         /* Frame rate actually programmed. */
};

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

static bool bk7258_gc2145_is_available(FAR struct imgsensor_s *sensor);
static int  bk7258_gc2145_init(FAR struct imgsensor_s *sensor);
static int  bk7258_gc2145_uninit(FAR struct imgsensor_s *sensor);
static FAR const char *
bk7258_gc2145_get_driver_name(FAR struct imgsensor_s *sensor);
static int  bk7258_gc2145_validate_frame_setting(
    FAR struct imgsensor_s *sensor, imgsensor_stream_type_t type,
    uint8_t nr_datafmts, FAR imgsensor_format_t *datafmts,
    FAR imgsensor_interval_t *interval);
static int  bk7258_gc2145_start_capture(
    FAR struct imgsensor_s *sensor, imgsensor_stream_type_t type,
    uint8_t nr_datafmts, FAR imgsensor_format_t *datafmts,
    FAR imgsensor_interval_t *interval);
static int  bk7258_gc2145_stop_capture(FAR struct imgsensor_s *sensor,
                                        imgsensor_stream_type_t type);
static int  bk7258_gc2145_get_frame_interval(
    FAR struct imgsensor_s *sensor, imgsensor_stream_type_t type,
    FAR imgsensor_interval_t *interval);

/****************************************************************************
 * Private Data
 ****************************************************************************/

/* Full GC2145 initialization register table (585 entries), ported
 * verbatim from dvp_gc2145.c.
 */

static const struct gc2145_reg g_gc2145_init_regs[] =
{
  { 0xFE, 0xF0 },
  { 0xFE, 0xF0 },
  { 0xFE, 0xF0 },
  { 0xFC, 0x06 },
  { 0xF6, 0x00 },
  { 0xF7, 0x1D },
  { 0xF8, 0x84 },
  { 0xFA, 0x00 },
  { 0xF9, 0xFE },
  { 0xF2, 0x00 },
  { 0xFE, 0x00 },
  { 0x03, 0x04 },
  { 0x04, 0xE2 },
  { 0x09, 0x00 },
  { 0x0A, 0x00 },
  { 0x0B, 0x00 },
  { 0x0C, 0x00 },
  { 0x0D, 0x04 },
  { 0x0E, 0xC0 },
  { 0x0F, 0x06 },
  { 0x10, 0x52 },
  { 0x12, 0x2E },
  { 0x17, 0x14 },
  { 0x18, 0x22 },
  { 0x19, 0x0E },
  { 0x1A, 0x01 },
  { 0x1B, 0x4B },
  { 0x1C, 0x07 },
  { 0x1D, 0x10 },
  { 0x1E, 0x88 },
  { 0x1F, 0x78 },
  { 0x20, 0x03 },
  { 0x21, 0x40 },
  { 0x22, 0xA0 },
  { 0x24, 0x16 },
  { 0x25, 0x01 },
  { 0x26, 0x10 },
  { 0x2D, 0x60 },
  { 0x30, 0x01 },
  { 0x31, 0x90 },
  { 0x33, 0x06 },
  { 0x34, 0x01 },
  { 0xFE, 0x00 },
  { 0x80, 0x7F },
  { 0x81, 0x26 },
  { 0x82, 0xFA },
  { 0x83, 0x00 },
  { 0x84, 0x02 },
  { 0x86, 0x03 },
  { 0x88, 0x03 },
  { 0x89, 0x03 },
  { 0x85, 0x08 },
  { 0x8A, 0x00 },
  { 0x8B, 0x00 },
  { 0xB0, 0x55 },
  { 0xC3, 0x00 },
  { 0xC4, 0x80 },
  { 0xC5, 0x90 },
  { 0xC6, 0x3B },
  { 0xC7, 0x46 },
  { 0xEC, 0x06 },
  { 0xED, 0x04 },
  { 0xEE, 0x60 },
  { 0xEF, 0x90 },
  { 0xB6, 0x01 },
  { 0x90, 0x01 },
  { 0x91, 0x00 },
  { 0x92, 0x00 },
  { 0x93, 0x00 },
  { 0x94, 0x00 },
  { 0x95, 0x04 },
  { 0x96, 0xB0 },
  { 0x97, 0x06 },
  { 0x98, 0x40 },
  { 0xFE, 0x00 },
  { 0x40, 0x42 },
  { 0x41, 0x00 },
  { 0x43, 0x5B },
  { 0x5E, 0x00 },
  { 0x5F, 0x00 },
  { 0x60, 0x00 },
  { 0x61, 0x00 },
  { 0x62, 0x00 },
  { 0x63, 0x00 },
  { 0x64, 0x00 },
  { 0x65, 0x00 },
  { 0x66, 0x20 },
  { 0x67, 0x20 },
  { 0x68, 0x20 },
  { 0x69, 0x20 },
  { 0x76, 0x00 },
  { 0x6A, 0x08 },
  { 0x6B, 0x08 },
  { 0x6C, 0x08 },
  { 0x6D, 0x08 },
  { 0x6E, 0x08 },
  { 0x6F, 0x08 },
  { 0x70, 0x08 },
  { 0x71, 0x08 },
  { 0x76, 0x00 },
  { 0x72, 0xF0 },
  { 0x7E, 0x3C },
  { 0x7F, 0x00 },
  { 0xFE, 0x02 },
  { 0x48, 0x15 },
  { 0x49, 0x00 },
  { 0x4B, 0x0B },
  { 0xFE, 0x00 },
  { 0xFE, 0x01 },
  { 0x01, 0x04 },
  { 0x02, 0xC0 },
  { 0x03, 0x04 },
  { 0x04, 0x90 },
  { 0x05, 0x30 },
  { 0x06, 0x90 },
  { 0x07, 0x30 },
  { 0x08, 0x80 },
  { 0x09, 0x00 },
  { 0x0A, 0x82 },
  { 0x0B, 0x11 },
  { 0x0C, 0x10 },
  { 0x11, 0x10 },
  { 0x13, 0x7B },
  { 0x17, 0x00 },
  { 0x1C, 0x11 },
  { 0x1E, 0x61 },
  { 0x1F, 0x35 },
  { 0x20, 0x40 },
  { 0x22, 0x40 },
  { 0x23, 0x20 },
  { 0xFE, 0x02 },
  { 0x0F, 0x04 },
  { 0xFE, 0x01 },
  { 0x12, 0x35 },
  { 0x15, 0xB0 },
  { 0x10, 0x31 },
  { 0x3E, 0x28 },
  { 0x3F, 0xB0 },
  { 0x40, 0x90 },
  { 0x41, 0x0F },
  { 0xFE, 0x02 },
  { 0x90, 0x6C },
  { 0x91, 0x03 },
  { 0x92, 0xCB },
  { 0x94, 0x33 },
  { 0x95, 0x84 },
  { 0x97, 0x65 },
  { 0xA2, 0x11 },
  { 0xFE, 0x00 },
  { 0xFE, 0x02 },
  { 0x80, 0xC1 },
  { 0x81, 0x08 },
  { 0x82, 0x05 },
  { 0x83, 0x08 },
  { 0x84, 0x0A },
  { 0x86, 0xF0 },
  { 0x87, 0x50 },
  { 0x88, 0x15 },
  { 0x89, 0xB0 },
  { 0x8A, 0x30 },
  { 0x8B, 0x10 },
  { 0xFE, 0x01 },
  { 0x21, 0x04 },
  { 0xFE, 0x02 },
  { 0xA3, 0x50 },
  { 0xA4, 0x20 },
  { 0xA5, 0x40 },
  { 0xA6, 0x80 },
  { 0xAB, 0x40 },
  { 0xAE, 0x0C },
  { 0xB3, 0x46 },
  { 0xB4, 0x64 },
  { 0xB6, 0x38 },
  { 0xB7, 0x01 },
  { 0xB9, 0x2B },
  { 0x3C, 0x04 },
  { 0x3D, 0x15 },
  { 0x4B, 0x06 },
  { 0x4C, 0x20 },
  { 0xFE, 0x00 },
  { 0xFE, 0x02 },
  { 0x10, 0x09 },
  { 0x11, 0x0D },
  { 0x12, 0x13 },
  { 0x13, 0x19 },
  { 0x14, 0x27 },
  { 0x15, 0x37 },
  { 0x16, 0x45 },
  { 0x17, 0x53 },
  { 0x18, 0x69 },
  { 0x19, 0x7D },
  { 0x1A, 0x8F },
  { 0x1B, 0x9D },
  { 0x1C, 0xA9 },
  { 0x1D, 0xBD },
  { 0x1E, 0xCD },
  { 0x1F, 0xD9 },
  { 0x20, 0xE3 },
  { 0x21, 0xEA },
  { 0x22, 0xEF },
  { 0x23, 0xF5 },
  { 0x24, 0xF9 },
  { 0x25, 0xFF },
  { 0xFE, 0x00 },
  { 0xC6, 0x20 },
  { 0xC7, 0x2B },
  { 0xFE, 0x02 },
  { 0x26, 0x0F },
  { 0x27, 0x14 },
  { 0x28, 0x19 },
  { 0x29, 0x1E },
  { 0x2A, 0x27 },
  { 0x2B, 0x33 },
  { 0x2C, 0x3B },
  { 0x2D, 0x45 },
  { 0x2E, 0x59 },
  { 0x2F, 0x69 },
  { 0x30, 0x7C },
  { 0x31, 0x89 },
  { 0x32, 0x98 },
  { 0x33, 0xAE },
  { 0x34, 0xC0 },
  { 0x35, 0xCF },
  { 0x36, 0xDA },
  { 0x37, 0xE2 },
  { 0x38, 0xE9 },
  { 0x39, 0xF3 },
  { 0x3A, 0xF9 },
  { 0x3B, 0xFF },
  { 0xFE, 0x02 },
  { 0xD1, 0x32 },
  { 0xD2, 0x32 },
  { 0xD3, 0x40 },
  { 0xD6, 0xF0 },
  { 0xD7, 0x10 },
  { 0xD8, 0xDA },
  { 0xDD, 0x14 },
  { 0xDE, 0x86 },
  { 0xED, 0x80 },
  { 0xEE, 0x00 },
  { 0xEF, 0x3F },
  { 0xD8, 0xD8 },
  { 0xFE, 0x01 },
  { 0x9F, 0x40 },
  { 0xFE, 0x01 },
  { 0xC2, 0x14 },
  { 0xC3, 0x0D },
  { 0xC4, 0x0C },
  { 0xC8, 0x15 },
  { 0xC9, 0x0D },
  { 0xCA, 0x0A },
  { 0xBC, 0x24 },
  { 0xBD, 0x10 },
  { 0xBE, 0x0B },
  { 0xB6, 0x25 },
  { 0xB7, 0x16 },
  { 0xB8, 0x15 },
  { 0xC5, 0x00 },
  { 0xC6, 0x00 },
  { 0xC7, 0x00 },
  { 0xCB, 0x00 },
  { 0xCC, 0x00 },
  { 0xCD, 0x00 },
  { 0xBF, 0x07 },
  { 0xC0, 0x00 },
  { 0xC1, 0x00 },
  { 0xB9, 0x00 },
  { 0xBA, 0x00 },
  { 0xBB, 0x00 },
  { 0xAA, 0x01 },
  { 0xAB, 0x01 },
  { 0xAC, 0x00 },
  { 0xAD, 0x05 },
  { 0xAE, 0x06 },
  { 0xAF, 0x0E },
  { 0xB0, 0x0B },
  { 0xB1, 0x07 },
  { 0xB2, 0x06 },
  { 0xB3, 0x17 },
  { 0xB4, 0x0E },
  { 0xB5, 0x0E },
  { 0xD0, 0x09 },
  { 0xD1, 0x00 },
  { 0xD2, 0x00 },
  { 0xD6, 0x08 },
  { 0xD7, 0x00 },
  { 0xD8, 0x00 },
  { 0xD9, 0x00 },
  { 0xDA, 0x00 },
  { 0xDB, 0x00 },
  { 0xD3, 0x0A },
  { 0xD4, 0x00 },
  { 0xD5, 0x00 },
  { 0xA4, 0x00 },
  { 0xA5, 0x00 },
  { 0xA6, 0x77 },
  { 0xA7, 0x77 },
  { 0xA8, 0x77 },
  { 0xA9, 0x77 },
  { 0xA1, 0x80 },
  { 0xA2, 0x80 },
  { 0xFE, 0x01 },
  { 0xDF, 0x0D },
  { 0xDC, 0x25 },
  { 0xDD, 0x30 },
  { 0xE0, 0x77 },
  { 0xE1, 0x80 },
  { 0xE2, 0x77 },
  { 0xE3, 0x90 },
  { 0xE6, 0x90 },
  { 0xE7, 0xA0 },
  { 0xE8, 0x90 },
  { 0xE9, 0xA0 },
  { 0xFE, 0x00 },
  { 0xFE, 0x01 },
  { 0x4F, 0x00 },
  { 0x4F, 0x00 },
  { 0x4B, 0x01 },
  { 0x4F, 0x00 },
  { 0x4C, 0x01 },
  { 0x4D, 0x71 },
  { 0x4E, 0x01 },
  { 0x4C, 0x01 },
  { 0x4D, 0x91 },
  { 0x4E, 0x01 },
  { 0x4C, 0x01 },
  { 0x4D, 0x70 },
  { 0x4E, 0x01 },
  { 0x4C, 0x01 },
  { 0x4D, 0x90 },
  { 0x4E, 0x02 },
  { 0x4C, 0x01 },
  { 0x4D, 0xB0 },
  { 0x4E, 0x02 },
  { 0x4C, 0x01 },
  { 0x4D, 0x8F },
  { 0x4E, 0x02 },
  { 0x4C, 0x01 },
  { 0x4D, 0x6F },
  { 0x4E, 0x02 },
  { 0x4C, 0x01 },
  { 0x4D, 0xAF },
  { 0x4E, 0x02 },
  { 0x4C, 0x01 },
  { 0x4D, 0xD0 },
  { 0x4E, 0x02 },
  { 0x4C, 0x01 },
  { 0x4D, 0xF0 },
  { 0x4E, 0x02 },
  { 0x4C, 0x01 },
  { 0x4D, 0xCF },
  { 0x4E, 0x02 },
  { 0x4C, 0x01 },
  { 0x4D, 0xEF },
  { 0x4E, 0x02 },
  { 0x4C, 0x01 },
  { 0x4D, 0x6E },
  { 0x4E, 0x03 },
  { 0x4C, 0x01 },
  { 0x4D, 0x8E },
  { 0x4E, 0x03 },
  { 0x4C, 0x01 },
  { 0x4D, 0xAE },
  { 0x4E, 0x03 },
  { 0x4C, 0x01 },
  { 0x4D, 0xCE },
  { 0x4E, 0x03 },
  { 0x4C, 0x01 },
  { 0x4D, 0x4D },
  { 0x4E, 0x03 },
  { 0x4C, 0x01 },
  { 0x4D, 0x6D },
  { 0x4E, 0x03 },
  { 0x4C, 0x01 },
  { 0x4D, 0x8D },
  { 0x4E, 0x03 },
  { 0x4C, 0x01 },
  { 0x4D, 0xAD },
  { 0x4E, 0x03 },
  { 0x4C, 0x01 },
  { 0x4D, 0xCD },
  { 0x4E, 0x03 },
  { 0x4C, 0x01 },
  { 0x4D, 0x4C },
  { 0x4E, 0x03 },
  { 0x4C, 0x01 },
  { 0x4D, 0x6C },
  { 0x4E, 0x03 },
  { 0x4C, 0x01 },
  { 0x4D, 0x8C },
  { 0x4E, 0x03 },
  { 0x4C, 0x01 },
  { 0x4D, 0xAC },
  { 0x4E, 0x03 },
  { 0x4C, 0x01 },
  { 0x4D, 0xCC },
  { 0x4E, 0x03 },
  { 0x4C, 0x01 },
  { 0x4D, 0xCB },
  { 0x4E, 0x03 },
  { 0x4C, 0x01 },
  { 0x4D, 0x4B },
  { 0x4E, 0x03 },
  { 0x4C, 0x01 },
  { 0x4D, 0x6B },
  { 0x4E, 0x03 },
  { 0x4C, 0x01 },
  { 0x4D, 0x8B },
  { 0x4E, 0x03 },
  { 0x4C, 0x01 },
  { 0x4D, 0xAB },
  { 0x4E, 0x03 },
  { 0x4C, 0x01 },
  { 0x4D, 0x8A },
  { 0x4E, 0x04 },
  { 0x4C, 0x01 },
  { 0x4D, 0xAA },
  { 0x4E, 0x04 },
  { 0x4C, 0x01 },
  { 0x4D, 0xCA },
  { 0x4E, 0x04 },
  { 0x4C, 0x01 },
  { 0x4D, 0xCA },
  { 0x4E, 0x04 },
  { 0x4C, 0x01 },
  { 0x4D, 0xC9 },
  { 0x4E, 0x04 },
  { 0x4C, 0x01 },
  { 0x4D, 0x8A },
  { 0x4E, 0x04 },
  { 0x4C, 0x01 },
  { 0x4D, 0x89 },
  { 0x4E, 0x04 },
  { 0x4C, 0x01 },
  { 0x4D, 0xA9 },
  { 0x4E, 0x04 },
  { 0x4C, 0x02 },
  { 0x4D, 0x0B },
  { 0x4E, 0x05 },
  { 0x4C, 0x02 },
  { 0x4D, 0x0A },
  { 0x4E, 0x05 },
  { 0x4C, 0x01 },
  { 0x4D, 0xEB },
  { 0x4E, 0x05 },
  { 0x4C, 0x01 },
  { 0x4D, 0xEA },
  { 0x4E, 0x05 },
  { 0x4C, 0x02 },
  { 0x4D, 0x09 },
  { 0x4E, 0x05 },
  { 0x4C, 0x02 },
  { 0x4D, 0x29 },
  { 0x4E, 0x05 },
  { 0x4C, 0x02 },
  { 0x4D, 0x2A },
  { 0x4E, 0x05 },
  { 0x4C, 0x02 },
  { 0x4D, 0x4A },
  { 0x4E, 0x05 },
  { 0x4C, 0x02 },
  { 0x4D, 0x8A },
  { 0x4E, 0x06 },
  { 0x4C, 0x02 },
  { 0x4D, 0x49 },
  { 0x4E, 0x06 },
  { 0x4C, 0x02 },
  { 0x4D, 0x69 },
  { 0x4E, 0x06 },
  { 0x4C, 0x02 },
  { 0x4D, 0x89 },
  { 0x4E, 0x06 },
  { 0x4C, 0x02 },
  { 0x4D, 0xA9 },
  { 0x4E, 0x06 },
  { 0x4C, 0x02 },
  { 0x4D, 0x48 },
  { 0x4E, 0x06 },
  { 0x4C, 0x02 },
  { 0x4D, 0x68 },
  { 0x4E, 0x06 },
  { 0x4C, 0x02 },
  { 0x4D, 0x69 },
  { 0x4E, 0x06 },
  { 0x4C, 0x02 },
  { 0x4D, 0xCA },
  { 0x4E, 0x07 },
  { 0x4C, 0x02 },
  { 0x4D, 0xC9 },
  { 0x4E, 0x07 },
  { 0x4C, 0x02 },
  { 0x4D, 0xE9 },
  { 0x4E, 0x07 },
  { 0x4C, 0x03 },
  { 0x4D, 0x09 },
  { 0x4E, 0x07 },
  { 0x4C, 0x02 },
  { 0x4D, 0xC8 },
  { 0x4E, 0x07 },
  { 0x4C, 0x02 },
  { 0x4D, 0xE8 },
  { 0x4E, 0x07 },
  { 0x4C, 0x02 },
  { 0x4D, 0xA7 },
  { 0x4E, 0x07 },
  { 0x4C, 0x02 },
  { 0x4D, 0xC7 },
  { 0x4E, 0x07 },
  { 0x4C, 0x02 },
  { 0x4D, 0xE7 },
  { 0x4E, 0x07 },
  { 0x4C, 0x03 },
  { 0x4D, 0x07 },
  { 0x4E, 0x07 },
  { 0x4F, 0x01 },
  { 0x50, 0x80 },
  { 0x51, 0xA8 },
  { 0x52, 0x47 },
  { 0x53, 0x38 },
  { 0x54, 0xC7 },
  { 0x56, 0x0E },
  { 0x58, 0x08 },
  { 0x5B, 0x00 },
  { 0x5C, 0x74 },
  { 0x5D, 0x8B },
  { 0x61, 0xDB },
  { 0x62, 0xB8 },
  { 0x63, 0x86 },
  { 0x64, 0xC0 },
  { 0x65, 0x04 },
  { 0x67, 0xA8 },
  { 0x68, 0xB0 },
  { 0x69, 0x00 },
  { 0x6A, 0xA8 },
  { 0x6B, 0xB0 },
  { 0x6C, 0xAF },
  { 0x6D, 0x8B },
  { 0x6E, 0x50 },
  { 0x6F, 0x18 },
  { 0x73, 0xF0 },
  { 0x70, 0x0D },
  { 0x71, 0x60 },
  { 0x72, 0x80 },
  { 0x74, 0x01 },
  { 0x75, 0x01 },
  { 0x7F, 0x0C },
  { 0x76, 0x70 },
  { 0x77, 0x58 },
  { 0x78, 0xA0 },
  { 0x79, 0x5E },
  { 0x7A, 0x54 },
  { 0x7B, 0x58 },
  { 0xFE, 0x00 },
  { 0xFE, 0x02 },
  { 0xC0, 0x01 },
  { 0xC1, 0x44 },
  { 0xC2, 0xFD },
  { 0xC3, 0x04 },
  { 0xC4, 0xF0 },
  { 0xC5, 0x48 },
  { 0xC6, 0xFD },
  { 0xC7, 0x46 },
  { 0xC8, 0xFD },
  { 0xC9, 0x02 },
  { 0xCA, 0xE0 },
  { 0xCB, 0x45 },
  { 0xCC, 0xEC },
  { 0xCD, 0x48 },
  { 0xCE, 0xF0 },
  { 0xCF, 0xF0 },
  { 0xE3, 0x0C },
  { 0xE4, 0x4B },
  { 0xE5, 0xE0 },
  { 0xFE, 0x01 },
  { 0x9F, 0x40 },
  { 0xFE, 0x00 },
  { 0xFE, 0x00 },
  { 0xF2, 0x0F },
  { 0xFE, 0x02 },
  { 0x40, 0xBF },
  { 0x46, 0xCF },
  { 0xFE, 0x00 },
  { 0xFE, 0x00 },
  { 0x24, 0xFF },
  { 0xFE, 0x00 },
};

#define GC2145_INIT_REG_COUNT \
  (sizeof(g_gc2145_init_regs) / sizeof(g_gc2145_init_regs[0]))

