open-vela/contest2026_264_VelaSightsuixingAIzhinengyanjing/board/beken/boards/bk7258/bk7258-ap/src/bk7258_camera_imgsensor.c
/* 640x480 resolution/window register table (40 entries). */

static const struct gc2145_reg g_gc2145_640_480_regs[] =
{
  { 0xFE, 0x00 },
  { 0x05, 0x01 },
  { 0x06, 0x56 },
  { 0x07, 0x00 },
  { 0x08, 0x32 },
  { 0xFE, 0x01 },
  { 0x25, 0x00 },
  { 0x26, 0xFA },
  { 0x27, 0x04 },
  { 0x28, 0xE2 },
  { 0x29, 0x04 },
  { 0x2A, 0xE2 },
  { 0x2B, 0x04 },
  { 0x2C, 0xE2 },
  { 0x2D, 0x04 },
  { 0x2E, 0xE2 },
  { 0xFE, 0x00 },
  { 0xFE, 0x00 },
  { 0xFE, 0x00 },
  { 0xF8, 0x85 },
  { 0xFA, 0x00 },
  { 0xFE, 0x00 },
  { 0x09, 0x00 },
  { 0x0A, 0x78 },
  { 0x0B, 0x00 },
  { 0x0C, 0xA0 },
  { 0x0D, 0x03 },
  { 0x0E, 0xD0 },
  { 0x0F, 0x05 },
  { 0x10, 0x10 },
  { 0xFD, 0x01 },
  { 0x90, 0x01 },
  { 0x91, 0x00 },
  { 0x92, 0x00 },
  { 0x93, 0x00 },
  { 0x94, 0x00 },
  { 0x95, 0x01 },
  { 0x96, 0xE0 },
  { 0x97, 0x02 },
  { 0x98, 0x80 },
};

#define GC2145_640_480_REG_COUNT \
  (sizeof(g_gc2145_640_480_regs) / sizeof(g_gc2145_640_480_regs[0]))

static const struct imgsensor_ops_s g_bk7258_gc2145_ops =
{
  .is_available           = bk7258_gc2145_is_available,
  .init                   = bk7258_gc2145_init,
  .uninit                 = bk7258_gc2145_uninit,
  .get_driver_name        = bk7258_gc2145_get_driver_name,
  .validate_frame_setting = bk7258_gc2145_validate_frame_setting,
  .start_capture          = bk7258_gc2145_start_capture,
  .stop_capture           = bk7258_gc2145_stop_capture,
  .get_frame_interval     = bk7258_gc2145_get_frame_interval,
};

/* Static capability descriptors: single discrete resolution/format,
 * matching this driver's single register table (no runtime resolution
 * switching).
 */

/* UYVY, not YUYV: the byte order YUV_BUF writes into the frame buffer is
 * U Y V Y.  Measured on hardware by dumping a captured frame -- read as
 * UYVY the chroma planes sit at ~128 with luma carrying the image's
 * dynamic range (18..153 over 120 rows), while read as YUYV the "luma"
 * is pinned near 128 and both chroma channels swing together, which no
 * real scene produces.  Note ctrl.yuv_fmt_sel stays at YUV_FORMAT_YUYV
 * (0) in bk7258_yuv_buf.c: that field describes the order the sensor
 * puts on the DVP bus, which is a separate thing from the order the
 * module writes to memory.
 */

static const struct v4l2_fmtdesc g_bk7258_gc2145_fmtdescs[] =
{
  {
    .index = 0,
    .type = V4L2_BUF_TYPE_VIDEO_CAPTURE,
    .pixelformat = V4L2_PIX_FMT_UYVY,
  },
};

static const struct v4l2_frmsizeenum g_bk7258_gc2145_frmsizes[] =
{
  {
    .index = 0,
    .pixel_format = V4L2_PIX_FMT_YUYV,
    .type = V4L2_FRMSIZE_TYPE_DISCRETE,
    .discrete =
      {
        .width = GC2145_CAPTURE_WIDTH,
        .height = GC2145_CAPTURE_HEIGHT,
      },
  },
};

/* Frame intervals actually programmable at 640x480 (see
 * g_gc2145_fps_regs).  Reported through VIDIOC_ENUM_FRAMEINTERVALS so
 * applications can discover them instead of guessing.
 */

static const struct v4l2_frmivalenum g_bk7258_gc2145_frmintervals[] =
{
  {
    .index = 0, .buf_type = V4L2_BUF_TYPE_VIDEO_CAPTURE,
    .pixel_format = V4L2_PIX_FMT_UYVY,
    .width = GC2145_CAPTURE_WIDTH, .height = GC2145_CAPTURE_HEIGHT,
    .type = V4L2_FRMIVAL_TYPE_DISCRETE,
    .discrete = { .numerator = 1, .denominator = 30 },
  },
  {
    .index = 1, .buf_type = V4L2_BUF_TYPE_VIDEO_CAPTURE,
    .pixel_format = V4L2_PIX_FMT_UYVY,
    .width = GC2145_CAPTURE_WIDTH, .height = GC2145_CAPTURE_HEIGHT,
    .type = V4L2_FRMIVAL_TYPE_DISCRETE,
    .discrete = { .numerator = 1, .denominator = 25 },
  },
  {
    .index = 2, .buf_type = V4L2_BUF_TYPE_VIDEO_CAPTURE,
    .pixel_format = V4L2_PIX_FMT_UYVY,
    .width = GC2145_CAPTURE_WIDTH, .height = GC2145_CAPTURE_HEIGHT,
    .type = V4L2_FRMIVAL_TYPE_DISCRETE,
    .discrete = { .numerator = 1, .denominator = 20 },
  },
  {
    .index = 3, .buf_type = V4L2_BUF_TYPE_VIDEO_CAPTURE,
    .pixel_format = V4L2_PIX_FMT_UYVY,
    .width = GC2145_CAPTURE_WIDTH, .height = GC2145_CAPTURE_HEIGHT,
    .type = V4L2_FRMIVAL_TYPE_DISCRETE,
    .discrete = { .numerator = 1, .denominator = 15 },
  },
};

/* Per-rate frame-length registers (page 0: 0x07 high, 0x08 low),
 * extracted from the reference's four 640x480 fps tables. */

struct gc2145_fps_regs
{
  uint32_t fps;
  uint8_t reg07;
  uint8_t reg08;
};

static const struct gc2145_fps_regs g_gc2145_fps_regs[] =
{
  { 30u, 0x00u, 0xA0u },
  { 25u, 0x01u, 0x7Au },
  { 20u, 0x03u, 0x02u },
  { 15u, 0x05u, 0x50u },
};

#define GC2145_FPS_COUNT \
  (sizeof(g_gc2145_fps_regs) / sizeof(g_gc2145_fps_regs[0]))

/* Everything the four fps tables have in common: page select, the fixed
 * 0x05/0x06 pair, then page 1's exposure-window registers.  0x07/0x08
 * are written between these two halves by
 * bk7258_gc2145_set_frame_rate().
 */

static const struct gc2145_reg g_gc2145_fps_prefix[] =
{
  { 0xFE, 0x00 }, { 0x05, 0x01 }, { 0x06, 0x56 },
};

static const struct gc2145_reg g_gc2145_fps_suffix[] =
{
  { 0xFE, 0x01 }, { 0x25, 0x01 }, { 0x26, 0x63 },
  { 0x27, 0x04 }, { 0x28, 0x29 }, { 0x29, 0x04 }, { 0x2A, 0x29 },
  { 0x2B, 0x04 }, { 0x2C, 0x29 }, { 0x2D, 0x04 }, { 0x2E, 0x29 },
  { 0xFE, 0x00 },
};

#define GC2145_FRMINTERVALS_COUNT \
  (sizeof(g_bk7258_gc2145_frmintervals) / \
   sizeof(g_bk7258_gc2145_frmintervals[0]))

#define GC2145_FPS_PREFIX_COUNT \
  (sizeof(g_gc2145_fps_prefix) / sizeof(g_gc2145_fps_prefix[0]))
#define GC2145_FPS_SUFFIX_COUNT \
  (sizeof(g_gc2145_fps_suffix) / sizeof(g_gc2145_fps_suffix[0]))

static struct bk7258_gc2145_dev_s g_bk7258_gc2145 =
{
  .sensor =
    {
      .ops = &g_bk7258_gc2145_ops,
      .fmtdescs_num = 1,
      .fmtdescs = g_bk7258_gc2145_fmtdescs,
      .frmsizes_num = 1,
      .frmsizes = g_bk7258_gc2145_frmsizes,
      .frmintervals_num = GC2145_FRMINTERVALS_COUNT,
      .frmintervals = g_bk7258_gc2145_frmintervals,
    },
  .current_fps = GC2145_FPS_DEFAULT,
};

/****************************************************************************
 * Private Functions
 ****************************************************************************/

static void bk7258_gc2145_power_on(void)
{
  bk7258_gpio_output(DVP_POWER_PIN, true);

  /* LDO settle delay before releasing reset. */

  up_udelay(120000);
}

static void bk7258_gc2145_reset(void)
{
  bk7258_gpio_output(DVP_RESET_PIN, false);
  up_udelay(120000);

  bk7258_gpio_output(DVP_RESET_PIN, true);
  up_udelay(120000);
}

