open-vela/contest2026_264_VelaSightsuixingAIzhinengyanjing/board/beken/boards/bk7258/bk7258-ap/src/bk7258_camera_imgsensor.c
static void bk7258_gc2145_dvp_pinmux(void)
{
  uint32_t i;

  bk7258_gpio_set_function(DVP_MCLK_PIN, DVP_MCLK_PINMUX_FUNCTION);
  bk7258_gpio_set_function(DVP_PCLK_PIN, DVP_PINMUX_FUNCTION);
  bk7258_gpio_set_function(DVP_HSYNC_PIN, DVP_PINMUX_FUNCTION);
  bk7258_gpio_set_function(DVP_VSYNC_PIN, DVP_PINMUX_FUNCTION);

  for (i = 0; i < 8; i++)
    {
      bk7258_gpio_set_function(DVP_DATA_PIN(i), DVP_PINMUX_FUNCTION);
    }
}

/* Enables the AUXS_CIS system clock path that supplies GC2145's MCLK
 * input (GPIO27).  Must be called after bk7258_gc2145_dvp_pinmux() has
 * already selected GPIO27's AUXS_CIS pinmux function, and before any
 * I2C traffic.
 */

static void bk7258_gc2145_mclk_enable(void)
{
  uint32_t reg;

  reg = getreg32(BK7258_SYS_REG_0X0A);
  reg &= ~(BK7258_SYS_CKSEL_AUXS_CIS_MASK | BK7258_SYS_CKDIV_AUXS_CIS_MASK);
  reg |= (GC2145_MCLK_CKSEL << BK7258_SYS_CKSEL_AUXS_CIS_SHIFT) &
         BK7258_SYS_CKSEL_AUXS_CIS_MASK;
  reg |= (GC2145_MCLK_CKDIV << BK7258_SYS_CKDIV_AUXS_CIS_SHIFT) &
         BK7258_SYS_CKDIV_AUXS_CIS_MASK;
  putreg32(reg, BK7258_SYS_REG_0X0A);

  reg = getreg32(BK7258_SYS_REG_0X0D);
  reg |= BK7258_SYS_CIS_AUXS_CKEN;
  putreg32(reg, BK7258_SYS_REG_0X0D);
}

static bool bk7258_gc2145_write_reg_table(const struct gc2145_reg *table,
                                           size_t count)
{
  size_t i;

  for (i = 0; i < count; i++)
    {
      if (!bk7258_i2c1_write_reg(GC2145_I2C_ADDR, table[i].reg,
                                  table[i].value))
        {
          return false;
        }
    }

  return true;
}

/* Symmetric counterpart of power_on()/reset()/mclk_enable(): assert
 * reset, cut the sensor's supply and close the MCLK clock gate.  Without
 * this, closing /dev/video0 left GPIO49 driving both DVP LDOs and the
 * AUXS_CIS clock running, i.e. the camera kept burning power with nobody
 * using it -- which matters on a battery-powered product.
 */

static void bk7258_gc2145_power_off(void)
{
  uint32_t reg;

  bk7258_gpio_output(DVP_RESET_PIN, false);

  reg = getreg32(BK7258_SYS_REG_0X0D);
  reg &= ~BK7258_SYS_CIS_AUXS_CKEN;
  putreg32(reg, BK7258_SYS_REG_0X0D);

  bk7258_gpio_output(DVP_POWER_PIN, false);
}

/* Programs the frame length for the requested rate.  GC2145 has no
 * dedicated frame-rate register: the rate follows from the frame length
 * (dummy lines) in page-0 registers 0x07/0x08, which is why the
 * reference ships one register table per rate.
 */

static bool bk7258_gc2145_set_frame_rate(
    FAR struct bk7258_gc2145_dev_s *priv, uint32_t fps)
{
  size_t i;

  for (i = 0; i < GC2145_FPS_COUNT; i++)
    {
      if (g_gc2145_fps_regs[i].fps == fps)
        {
          break;
        }
    }

  if (i == GC2145_FPS_COUNT)
    {
      return false;
    }

  if (!bk7258_gc2145_write_reg_table(g_gc2145_fps_prefix,
                                     GC2145_FPS_PREFIX_COUNT) ||
      !bk7258_i2c1_write_reg(GC2145_I2C_ADDR, 0x07u,
                             g_gc2145_fps_regs[i].reg07) ||
      !bk7258_i2c1_write_reg(GC2145_I2C_ADDR, 0x08u,
                             g_gc2145_fps_regs[i].reg08) ||
      !bk7258_gc2145_write_reg_table(g_gc2145_fps_suffix,
                                     GC2145_FPS_SUFFIX_COUNT))
    {
      return false;
    }

  priv->current_fps = fps;
  return true;
}

/* Reads GC2145's identity registers.  This is the only real proof that
 * the sensor is present, powered and talking -- the 585-entry init table
 * is write-only, so before this the driver could not distinguish "sensor
 * ACKed and configured" from "something on the bus ACKed".
 */

static bool bk7258_gc2145_check_chip_id(void)
{
  uint8_t hi = 0;
  uint8_t lo = 0;

  if (!bk7258_i2c1_read_reg(GC2145_I2C_ADDR, GC2145_CHIP_ID_REG_HI, &hi) ||
      !bk7258_i2c1_read_reg(GC2145_I2C_ADDR, GC2145_CHIP_ID_REG_LO, &lo))
    {
      printf("bk7258_camera_imgsensor: chip ID read failed\n");
      return false;
    }

  printf("bk7258_camera_imgsensor: chip ID = 0x%02x%02x (expected "
         "0x%02x%02x)\n", hi, lo,
         GC2145_CHIP_ID_VAL_HI, GC2145_CHIP_ID_VAL_LO);

  return hi == GC2145_CHIP_ID_VAL_HI && lo == GC2145_CHIP_ID_VAL_LO;
}

static bool bk7258_gc2145_is_available(FAR struct imgsensor_s *sensor)
{
  /* Deliberately unconditional.  A real probe would have to power the
   * sensor, start MCLK and run an I2C transaction, and this is called
   * from capture_register() during board bring-up -- doing all that here
   * would move the camera's power sequencing into boot, and a bus
   * glitch at that moment would make /dev/video0 disappear entirely
   * with no way to retry.  The identity check therefore runs inside
   * init() (bk7258_gc2145_check_chip_id()), where it reports a mismatch
   * without taking the device node away.
   */

  return true;
}

static int bk7258_gc2145_init(FAR struct imgsensor_s *sensor)
{
  FAR struct bk7258_gc2145_dev_s *priv =
      (FAR struct bk7258_gc2145_dev_s *)sensor;

  printf("bk7258_camera_imgsensor: init: entry\n");

  bk7258_gc2145_power_on();
  printf("bk7258_camera_imgsensor: init: power_on done\n");

  bk7258_gc2145_reset();
  printf("bk7258_camera_imgsensor: init: reset done\n");

  bk7258_gc2145_dvp_pinmux();
  printf("bk7258_camera_imgsensor: init: dvp_pinmux done\n");

  bk7258_gc2145_mclk_enable();
  printf("bk7258_camera_imgsensor: init: mclk_enable done, "
         "reg0x0a=0x%08x reg0x0d=0x%08x\n",
         (unsigned int)getreg32(BK7258_SYS_REG_0X0A),
         (unsigned int)getreg32(BK7258_SYS_REG_0X0D));

  bk7258_i2c1_init();
  printf("bk7258_camera_imgsensor: init: i2c1_init done\n");

  /* Identity check before the 585-entry blind write, so a wiring or bus
   * problem is reported as such instead of surfacing later as a
   * mid-table NACK.  A mismatch is reported but not fatal: the register
   * tables are known to work on this board, and refusing to continue
   * would turn any future read-timing regression into "the camera is
   * gone".
   */

  if (!bk7258_gc2145_check_chip_id())
    {
      printf("bk7258_camera_imgsensor: init: chip ID mismatch or read "
             "failure, continuing anyway\n");
    }

