open-vela/contest2026_264_VelaSightsuixingAIzhinengyanjing/board/beken/boards/bk7258/bk7258-ap/src/bk7258_camera_imgsensor.c
  printf("bk7258_camera_imgsensor: init: writing %u init registers\n",
         (unsigned int)GC2145_INIT_REG_COUNT);

  if (!bk7258_gc2145_write_reg_table(g_gc2145_init_regs,
                                      GC2145_INIT_REG_COUNT))
    {
      printf("bk7258_camera_imgsensor: init: init register table write "
             "FAILED\n");
      bk7258_gc2145_power_off();
      return -EIO;
    }

  printf("bk7258_camera_imgsensor: init: init register table write OK, "
         "writing %u resolution registers\n",
         (unsigned int)GC2145_640_480_REG_COUNT);

  if (!bk7258_gc2145_write_reg_table(g_gc2145_640_480_regs,
                                      GC2145_640_480_REG_COUNT))
    {
      printf("bk7258_camera_imgsensor: init: resolution register table "
             "write FAILED\n");
      bk7258_gc2145_power_off();
      return -EIO;
    }

  if (!bk7258_gc2145_set_frame_rate(priv, GC2145_FPS_DEFAULT))
    {
      printf("bk7258_camera_imgsensor: init: %ufps program FAILED\n",
             (unsigned int)GC2145_FPS_DEFAULT);
      bk7258_gc2145_power_off();
      return -EIO;
    }

  printf("bk7258_camera_imgsensor: init: complete at %ufps, sensor now "
         "continuously outputting DVP signal\n",
         (unsigned int)priv->current_fps);

  priv->initialized = true;
  return OK;
}

static int bk7258_gc2145_uninit(FAR struct imgsensor_s *sensor)
{
  FAR struct bk7258_gc2145_dev_s *priv =
      (FAR struct bk7258_gc2145_dev_s *)sensor;

  bk7258_gc2145_power_off();
  priv->initialized = false;

  printf("bk7258_camera_imgsensor: uninit: sensor powered off, MCLK "
         "gate closed\n");

  return OK;
}

static FAR const char *
bk7258_gc2145_get_driver_name(FAR struct imgsensor_s *sensor)
{
  return "GC2145";
}

static int bk7258_gc2145_validate_frame_setting(
    FAR struct imgsensor_s *sensor, imgsensor_stream_type_t type,
    uint8_t nr_datafmts, FAR imgsensor_format_t *datafmts,
    FAR imgsensor_interval_t *interval)
{
  if (nr_datafmts < 1)
    {
      return -EINVAL;
    }

  /* Only 640x480 UYVY is supported -- this driver's register tables do
   * not implement any other resolution, and UYVY is the byte order the
   * capture path actually produces (see g_bk7258_gc2145_fmtdescs).
   */

  if (datafmts[IMGSENSOR_FMT_MAIN].width != GC2145_CAPTURE_WIDTH ||
      datafmts[IMGSENSOR_FMT_MAIN].height != GC2145_CAPTURE_HEIGHT ||
      datafmts[IMGSENSOR_FMT_MAIN].pixelformat != IMGSENSOR_PIX_FMT_UYVY)
    {
      return -EINVAL;
    }

  /* A requested frame rate must be one this driver can actually
   * program; silently accepting an arbitrary rate and then running at a
   * different one is what made the `30` in `stream 640 480 30` a lie.
   */

  if (interval != NULL && interval->denominator != 0)
    {
      uint32_t fps = interval->denominator / (interval->numerator ?
                                             interval->numerator : 1);
      size_t i;

      for (i = 0; i < GC2145_FPS_COUNT; i++)
        {
          if (g_gc2145_fps_regs[i].fps == fps)
            {
              break;
            }
        }

      if (i == GC2145_FPS_COUNT)
        {
          return -EINVAL;
        }
    }

  return OK;
}

static int bk7258_gc2145_start_capture(
    FAR struct imgsensor_s *sensor, imgsensor_stream_type_t type,
    uint8_t nr_datafmts, FAR imgsensor_format_t *datafmts,
    FAR imgsensor_interval_t *interval)
{
  FAR struct bk7258_gc2145_dev_s *priv =
      (FAR struct bk7258_gc2145_dev_s *)sensor;
  int ret;

  printf("bk7258_camera_imgsensor: start_capture: entry\n");

  ret = bk7258_gc2145_validate_frame_setting(sensor, type, nr_datafmts,
                                              datafmts, interval);
  if (ret < 0)
    {
      printf("bk7258_camera_imgsensor: start_capture: validate failed, "
             "ret=%d\n", ret);
      return ret;
    }

  /* Apply the requested frame rate if it differs from what is already
   * programmed.  validate_frame_setting() above has already rejected
   * rates this driver cannot produce.
   */

  if (interval != NULL && interval->denominator != 0)
    {
      uint32_t fps = interval->denominator / (interval->numerator ?
                                             interval->numerator : 1);

      if (fps != priv->current_fps &&
          !bk7258_gc2145_set_frame_rate(priv, fps))
        {
          printf("bk7258_camera_imgsensor: start_capture: %ufps program "
                 "FAILED\n", (unsigned int)fps);
          return -EIO;
        }
    }

  /* GC2145 has no separate streaming-enable register in this driver's
   * ported tables -- the sensor outputs DVP data continuously once its
   * init sequence completes in bk7258_gc2145_init().  Capture
   * start/stop is entirely a matter of whether the imgdata half
   * (YUV_BUF) is listening.
   */

  printf("bk7258_camera_imgsensor: start_capture: OK at %ufps (sensor "
         "streaming continuously since init)\n",
         (unsigned int)priv->current_fps);

  return OK;
}

static int bk7258_gc2145_get_frame_interval(
    FAR struct imgsensor_s *sensor, imgsensor_stream_type_t type,
    FAR imgsensor_interval_t *interval)
{
  FAR struct bk7258_gc2145_dev_s *priv =
      (FAR struct bk7258_gc2145_dev_s *)sensor;

  if (interval == NULL)
    {
      return -EINVAL;
    }

  /* Report the rate that is actually programmed, so VIDIOC_G_PARM
   * reflects hardware state rather than whatever the caller last asked
   * for.
   */

  interval->numerator = 1;
  interval->denominator = priv->current_fps;

  return OK;
}

static int bk7258_gc2145_stop_capture(FAR struct imgsensor_s *sensor,
                                       imgsensor_stream_type_t type)
{
  /* v4l2_cap.c's complete_capture() calls IMGSENSOR_STOP_CAPTURE() from
   * interrupt context when it runs out of vacant buffer containers, so
   * this must not printf().  GC2145 keeps streaming regardless (no
   * streaming-enable bit in this driver's register tables), so there is
   * nothing to do here anyway.
   */

  return OK;
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

FAR struct imgsensor_s *bk7258_camera_imgsensor_initialize(void)
{
  return &g_bk7258_gc2145.sensor;
}
